In [72]:
import pandas as pd
import numpy as np
import seaborn as snb

In [40]:
df = pd.read_csv(r'C:\Users\d\Desktop\file6.csv')

In [41]:
df

  Make;year ;cost;miles;accedent
0         BMW;2008;20000;43200;2
1       VOLVO;2011;16600;31700;0
2      VOLVO;2008;10998;102790;3
3       VOLVO;2012;15000;34000;2
4       VOLVO;2013;20500;12023;0
5       VOLVO;2008;12800;65200;2
6         BMW;2012;52000;18500;0
7         BMW;2011;50000;19000;2
8        BMW;2006;13500;100000;0
9         BMW;2009;25000;40000;1

In [43]:
summary = df.describe()
print(summary)

       Make;year ;cost;miles;accedent
count                              10
unique                             10
top            BMW;2008;20000;43200;2
freq                                1

In [44]:
print(df.shape)

(10, 1)

In [45]:
print(df.columns)

Index(['Make;year ;cost;miles;accedent'], dtype='object')

In [46]:
df.isnull()

   Make;year ;cost;miles;accedent
0                           False
1                           False
2                           False
3                           False
4                           False
5                           False
6                           False
7                           False
8                           False
9                           False

In [47]:
df.isnull().sum()

Make;year ;cost;miles;accedent    0
dtype: int64

In [48]:
df.isnull().sum().sum()

0

In [51]:
df.fillna(value=1)

  Make;year ;cost;miles;accedent
0         BMW;2008;20000;43200;2
1       VOLVO;2011;16600;31700;0
2      VOLVO;2008;10998;102790;3
3       VOLVO;2012;15000;34000;2
4       VOLVO;2013;20500;12023;0
5       VOLVO;2008;12800;65200;2
6         BMW;2012;52000;18500;0
7         BMW;2011;50000;19000;2
8        BMW;2006;13500;100000;0
9         BMW;2009;25000;40000;1

In [52]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [61]:
df

  Make;year ;cost;miles;accedent
0         BMW;2008;20000;43200;2
1       VOLVO;2011;16600;31700;0
2      VOLVO;2008;10998;102790;3
3       VOLVO;2012;15000;34000;2
4       VOLVO;2013;20500;12023;0
5       VOLVO;2008;12800;65200;2
6         BMW;2012;52000;18500;0
7         BMW;2011;50000;19000;2
8        BMW;2006;13500;100000;0
9         BMW;2009;25000;40000;1

In [65]:
 from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [69]:
 ct=ColumnTransformer(transformers=[('encoder' ,OneHotEncoder() , [0])] , remainder= 'passthrough')

In [70]:
df = np.array(ct.fit_transform(df))

In [71]:
df

array(<10x10 sparse matrix of type '<class 'numpy.float64'>'
	with 10 stored elements in Compressed Sparse Row format>, dtype=object)